const koAliasGen = () => {
    const [A, B] = [[
        '가냘픈','가느다란','가득가득한','건조한','게으른','가엾은','거센','고운','곧은','고마운','구석진','귀여운','그리운','기쁜','깨끗한','거친','가뜬한','심술궃은',
        '너그러운','나쁜','난데없는','날카로운','누런','높은','네모난','느린','낡은','널따란','시원한','굉장한','까다로운','깔끔한','떫은','맹맹한','목욕하는','무덤덤한',
        '동그란','뒤늦은','뛰어난','뜨거운','딱딱한','뜨뜻한','달그락거리는','덜컹이는','든든한','독특한','대단한','둔한','다정한','달콤한','무서운','미운','예민한',
        '막다른','치킨먹는','햄버거먹는','어지러운','상냥한','무시무시한','일하는','코딩하는','수영하는','운동하는','공부하는','목욕하는','요리하는','삽질하는','그네타는',
        '바람직한','바삭바삭한','반가운','밝은','보드라운','보람찬','부드러운','비싼','빠른','뽀얀','새콤한','행복한','근엄한','많은','매운','멋진','메마른','무른','머나먼',
        '새로운','서툰','섣부른','성가신','강한','수다스러운','수줍은','쌀쌀맞은','쏜살같은','쓰디쓴','성난','섭섭한','소심한','순수한','속상한','순진한','심심한','씩씩한',
        '아름다운','아쉬운','안타까운','알맞은','약빠른','약은','얇은','어두운','어려운','어린','언짢은','엄청난','열띤','예쁜','올바른','외로운','우스운','의심쩍은','이른',
        '잘난','재미있는','젊은','점잖은','정다운','조그만','좁은','주제넘은','줄기찬','즐거운','지나친','지혜로운','늠름한','화려한','짓궃은','새까만','짧은','걱정하는',
        '케케묵은','탐스러운','푸른','한결같은','희망찬','힘겨운','힘찬','향기로운','차분한','해로운','풍부한','포근한','화창한','훌륭한','황당한','커다란','푸르른',
        '잠자는','늦잠자는','산책하는','노래하는','춤추는','반짝반짝한','깜짝놀란','겁먹은','노래듣는','잘난체하는','화난','청소하는','이사가는','인사하는','생각하는','막막한',
        '거울보는','라면끓이는','커피마시는','학교가는','놀러가는','절하는','기부하는','쇼핑하는','식사하는','배고픈','질투하는','놀러가는','학원가는','여행가는','먹는','고민하는',
        '지루한','게임하는','야생의','장난치는','꿈꾸는','등산하는','쩔쩔매는','머리빗는','단호한','경례하는','건방진','손흔드는','으쓱으쓱','엄지척','졸린','킹받은','째려보는',
        '무거운','운전하는','모자쓴','해킹하는','영화보는','축구하는','편지쓰는','웃음참는','물마시는','울먹이는','실험하는','책읽는','웹툰보는','시험보는','피리부는','한가한',
        '사진찍는','알바하는','기타치는','기뻐하는','말썽쟁이','친절한','한숨쉬는','군대가는','진지한','그림그리는','보드타는','스키타는','노력하는','흥얼거리는','뜨개질하는',
        '똑똑한','하품하는','세수하는','성실한','부지런한','건배하는','신나는','초롱초롱','울고있는','빈털터리','멋쟁이','시건방진','무뚝뚝한','교만한','교활한','사이좋은',
        '미끄러운','부끄러운','솔직한','우아한','위대한','엉뚱한','영리한','공손한','귀중한','놀라운','단정한','신기한','소중한','엉뚱한','이상한','뚱뚱한','유명한',
        '사려깊은','관대한','용감한','심각한','파닥이는','피곤한','버그걸린','오류난','렉걸린','고장난','달리기하는','낮잠자는','알록달록한','술마시는','흔들거리는','튼튼한',
        '눈부신','복잡한','새파란','시소타는','굴러가는','반짝거리는','조용한','당당한','미심쩍은','믿음직한','슬기로운','푸짐한','푹신한','가파른','시끄러운', '떡상하는', '떡락하는'
        ,'덜렁대는'
    ], [
        '하마','부엉이','도마뱀','고양이','다람쥐','나비','닭','금붕어','늑대','사자','나무늘보','침팬지','여우','양파','쪽파','양배추','샐러리','낙타','양','사슴',
        '표고버섯','하늘소','원숭이','기린','일본원숭이','펭귄','거위','고라니','가마우지','개구리','곰','너구리','도롱뇽','물개','상어','이구아나','오랑우탄','뉴트리아',
        '얼룩소','오리너구리','오소리','이리','고래','돌고래','흰수염고래','노루','재규어','자칼','코뿔소','판다','청설모','호랑이','비버','산양','염소','살쾡이','로봇',
        '코끼리','코알라','캥거루','고등어','참치','연어','가재','표범','흰쥐','푸들','달팽이','민달팽이','호랑나비','호랑거미','알파카','하이에나','바다코끼리','카멜레온',
        '당나귀','올빼미','꿩','맹꽁이','수달','순록','거북이','자라','두루미','북극곰','퓨마','미어캣','코요태','딱따구리','기러기','매','참새','멧돼지','들소','물소',
        '살모사','구렁이','스라소니','타조','돼지','꽃게','악어','소','백조','오리','청둥오리','우파루파','제비','공작','병아리','해파리','불가사리','나방','올챙이','얼룩말',
        '문어','오징어','개미','파리','맘모스','가젤','반달가슴곰','족제비','솔개','무당벌레','햄스터','공룡','모기','주머니쥐','황소','벨루가','향유고래','박하사탕','돋보기',
        '도요새','펠리컨','벌새','콘도르','비단뱀','청개구리','청새치','날치','넙치','장어','잉어','잠자리','꿀벌','물벼룩','소금쟁이','매미','물방개','귀뚜라미','배짱이','여치',
        '반딧불이','탕수육','사천탕수육','짜장면','샌드위치','순대볶음','로제떡볶이','떡볶이','순대','순대볶음','단무지','김치찌개','케밥','피자','당구공','볼링공','탁구공','농구공',
        '보름달','초승달','키보드','충전기','마우스','상자','담비','붉은여우','사막여우','독수리','황조롱이','뻐꾸기','비둘기','멧비둘기','후투티','백상아리','대왕판다','아르마딜로',
        '피망','오이','바나나','파인애플','망고','빙어','승냥이','토끼풀','민들레','나팔꽃','해바라기','무궁화','개나리','오렌지','당근','은행나무','소나무','버드나무','크레파스',
        '색연필','의자','쓰레기통','고슴도치','복숭아','목화','벽돌','하모니카','트럼펫','피아노','자전거','기차','나무꾼','천사','서류철','낙엽','나뭇잎','마요네즈','탬버린',
        '플루트','클라리넷','드라이버','안경곰','몽구스','박쥐','과일박쥐','사슴벌레','딱정벌레','애벌레','용','뱅갈고양이','리트리버','사탕','축구공','배구공','테니스공',
        '아메리카노','식빵','팽이버섯','돛단배','종이학','마을버스','난로','모닥불','라임나무','시냇물','물병','현미경','양성자','중성자','실뭉치','계산기','파슬리','카레라이스',
        '물만두','군만두','칠리소스','오이피클','자몽','레몬','포도주스','빗자루','종이컵','단풍잎','떡잎','잔디','금덩이','꽹가리','장구채','고구마','감자','찻잔','토네이도',
        '눈사람','미끄럼틀','장난감','굴렁쇠','젖소','허스키','장미꽃','정수기','우산','칫솔','쿠키','감자칩','초콜릿','감자튀김','배추김치','깍두기','붕어빵','호두과자','아이스크림',
        '트라이앵글','캐스터네츠','리코더','바이올린','청양고추','콩나물','완두콩','도토리','무화과','은덩이','소시지','핫도그','토스트','보리차','녹차','누룽지','깃발',
        '지푸라기','연꽃','아쟁','가야금','태평소','장구','탄알집','아코디언','실로폰','감기약','바이러스','밤송이','대추','땅콩','밥솥','아이스티','시계','바구니','달고나',
        '케이크','호떡','우동','라면','샐러드','팽이','딱지','주사위','얼음','딸기잼','머스타드','알약','종이배','종이비행기','옥수수','나침반','원자핵','번갯불','타이어',
        '꽃병','초코파이','컴퓨터','메모리','유자차','땅콩잼','팥죽','아궁이','공책','일기장','각도기','지우개','샤프심','연필깎이','연필','책상','젤리','마라탕','김치전',
        '수제비','파전','부침개','연어초밥','초코우유','커피우유','콜라','미꾸라지','가오리','바다사자','바다표범','딸기우유','라떼','도넛','헬리콥터','직박구리','풀무치',
        '통조림','김치볶음밥','해삼','멍게','말미잘','마구니','청경채','로봇청소기','하드디스크','외장하드','월남쌈','삼겹살','민트초코','컵라면','삼각김밥','주먹밥','회덮밥',
        '소고','단소','거문고','태평소','피리','오카리나'
    ]];

    const IDX_A = parseInt(A.length * Math.random());
    const IDX_B = parseInt(B.length * Math.random());

    return `${A[IDX_A]} ${B[IDX_B]}`;
}
